Revit 2027 API
BuiltInFailures.DimensionFailures.ArcLengthDimensionReferencesNotIntersect Property
 One or more dimension references of this Arc Length dimension no longer intersect the circle needed for arc length computation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArcLengthDimensionReferencesNotIntersect { get; }
Public Shared ReadOnly Property ArcLengthDimensionReferencesNotIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArcLengthDimensionReferencesNotIntersect {
	FailureDefinitionId^ get ();
}
static member ArcLengthDimensionReferencesNotIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace